const softHyphen = '\u00ad';

export default {
  general: {
    home: 'Головна',
    student: 'Учень',
    teacher: 'Вчитель',
    level: 'Рівень',
    levels: {
      1: 'Вступ',
      2: 'Початківець',
      3: 'Досвідчений',
      4: 'Експерт',
    },
    picture: 'Зображення {{title}}',
    glyphicon: 'Інформація про {{title}}',
  },
  head: {
    title: 'Клуб програмування',
    description: 'На цій сторінці ви знайдете завдання для дітей та підлітків будь-якого віку, які бажають навчитися програмуванню. ' +
                  'Увесь вміст на сайті безкоштовний для використання, ' +
                  'і часто використовується в клубах програмування та на уроках програмування в школах.',
  },
  frontpage: {
    courses: 'Курси',
    lessoncount: 'Завдань: {{count}}',
    otherwebsitecourses: 'Курси на інших сайтах',
    continueButton: 'Останній відвідуваний',
    teacherinfobox: {
      header: 'Привіт! Ви зараз у режимі вчителя',
      changemode: 'Ви не вчитель або інструктор? Натисніть кнопку учень/вчитель у навігаційному меню, ' +
                  'щоб змінити режим. Ви можете отримати більше інформації, натиснувши на значок плюс нижче',
      teacher: 'Вчитель',
      info1: 'Перегляньте наші фільтри та настанови щодо завдань. Ліворуч можна фільтрувати завдання за різними шкільними предметами, ' +
              'щоб знайти відповідні завдання для вашого навчання. Коли ви виберете предмети, ' +
              'ви побачите тільки ті завдання, які наші вчителі оцінили як відповідні. Ви можете обрати мову, ' +
              'якою будете викладати. Кожен набір завдань має настанову, у якій, зокрема, зазначені конкретні ' +
              'навчальні цілі, над якими можна працювати в різних предметах.',
      link1: 'Дізнайтеся більше про програмування у навчанні',
      assistant: 'Інструктор',
      info2: 'Наші набори завдань розраховані на те, що діти працюватимуть над різними проєктами здебільшого самостійно, ' +
              'але ми рекомендуємо розпочинати кожне заняття з 10-15-хвилинної вступної частини про те, що робити ' +
              'та що буде новим цього разу. Тепер ви можете легко фільтрувати завдання за темами, ' +
              'і всі набори завдань мають інструкції, які ви можете переглянути, щоб підготуватися до занять. ' +
              'Для початківців ми рекомендуємо блокове програмування, а далі продовжувати з Python / Web / Processing. ',
      link2: 'Дізнайтеся більше про управління клубом програмування',
      plus: 'Показати більше інформації',
      minus: 'Показати менше інформації',
    },
    showhidefilter: 'Показати/сховати фільтр',
  },
  coursepage: {
    courseinfo: 'Інформація про курс',
    courseinfonotfound: 'Упс, хтось забув написати інформацію про курс!',
    levelnavigation: 'Перейти до',
    lessoncollections: 'Збірки завдань',
    nomatchinglessons: 'Жодне завдання не відповідає фільтру',
    missingtitle: 'Збірка завдань',
    lessonsnottranslated: 'Завдання в цій збірці ще не були перекладені на українську.',
  },
  lessons: {
    writtenby: 'Автор:',
    translatedby: 'Переклав:',
    course: 'Курс:',
    pdf: 'Завантажити PDF',
    pdfstyling: 'Оберіть Зберегти як PDF. Потім можна обрати ' +
      'Додаткові налаштування та відзначити Фонову графіку, щоб додати більше кольорів.',
    print: 'Друк',
    toteacherinstruction: 'До інструкції для вчителя',
    tolesson: 'До завдання',
    reset: 'Скинути відмітки',
    tomainlanguage: 'На {{lang}}',
    nottranslated: 'Ця сторінка недоступна на {{lang}}',
    license: 'Ліцензія: ',
    improvepage: {
      header: 'Покращити цю сторінку',
      textline1: 'Знайшли помилку? Щось можна покращити?',
      textline2: 'Якщо так, будь ласка, залиште нам відгук, створивши проблему на GitHub ' +
                  'або виправте помилку самі, якщо можете. Ми вдячні за будь-який зворотний зв'язок!',
      newissuebutton: 'Повідомити про проблему',
      newissuelink: {
        title: 'Проблема з',
        lesson: 'Завдання',
        sourcecode: 'Вихідний код завдання',
        info: 'Описати вашу проблему тут. Будь ласка, вкажіть операційну систему, браузер та будь-який код, який ви написали.'
      },
      showcodebutton: 'Показати код і виправити самостійно',
      forumbutton: 'Перейти до форуму',
    },
  },
  filter: {
    header: 'Фільтр',
    tooltip: 'Якщо обрати "Усі завдання", ' +
      'у фільтрі можна відсортувати завдання за темами, над якими хочете працювати.',
    radio: {
      playlists: `Збірки${softHyphen}завдань`,
      lessons: 'Усі завдання',
      group: 'Група з двома варіантами',
    },
    removefilter: 'Скинути фільтр',
  },
  navbar: {
    mode: 'Режим',
    lkknav: {
      aboutlkk: 'Om LKK',
      news: 'Nyheter',
      lessons: 'Oppgaver',
      findcodeclub: 'Finn kodeklubb',
      codeclub: 'Kodeklubben',
      school: 'Skole',
      codehour: 'Kodetimen',
      contribute: 'Bidra?',
    },
    menu: 'Meny',
  },
  search: {
    placeholder: 'Søk',
  },
  footer: {
    contribute: 'Lag egne oppgaver',
    dyslexia: 'Skrift for dyslektikere',
  },
  404: {
    header: 'Beklager',
    textline: 'Vi finner ikke siden du leter etter.',
    tofrontpage: 'Til forsiden',
  },
};
